<script setup>
import HorizontalRule from '@/components/HorizontalRule.vue';
import MovieCard from '@/components/MovieCard.vue';
</script>

<template>
  <h1 class="main-header">Фильмы</h1>
  <HorizontalRule />
  <div class="cards">
    <MovieCard
      poster="https://image.openmoviedb.com/kinopoisk-images/1599028/0b76b2a2-d1c7-4f04-a284-80ff7bb709a4/orig"
      title="Побег из Шоушенка"
      :year="1994"
      description="Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения."
      :genres="['Драма']"
      :directors="['Фрэнк Дарабонт']"
      :actors="['Тим Роббинс', 'Морган Фриман', 'Боб Гантон', 'Уильям Сэдлер', 'Клэнси Браун', 'Джил Беллоуз', 'Марк Ролстон', 'Джеймс Уитмор', 'Джеффри ДеМанн', 'Ларри Бранденбург', 'Диомид Виноградов', 'Игорь Старосельцев', 'Никита Прозоровский', 'Олег Вирозуб', 'Василий Дахненко']"
      duration="142 мин. / 02:22"
      :animated-hover="true"
      link="/movie"
    />
    <MovieCard
      poster="https://image.openmoviedb.com/kinopoisk-images/1599028/0b76b2a2-d1c7-4f04-a284-80ff7bb709a4/orig"
      title="Побег из Шоушенка"
      :year="1994"
      description="Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения."
      :genres="['Драма']"
      :directors="['Фрэнк Дарабонт']"
      :actors="['Тим Роббинс', 'Морган Фриман', 'Боб Гантон', 'Уильям Сэдлер', 'Клэнси Браун', 'Джил Беллоуз', 'Марк Ролстон', 'Джеймс Уитмор', 'Джеффри ДеМанн', 'Ларри Бранденбург', 'Диомид Виноградов', 'Игорь Старосельцев', 'Никита Прозоровский', 'Олег Вирозуб', 'Василий Дахненко']"
      duration="142 мин. / 02:22"
      :animated-hover="true"
      link="/movie"
    />
  </div>
</template>

<style>
.main-header {
  font-weight: 500;
  font-size: 32px;
  line-height: 1;
  margin: 0 0 16px;
}

.cards {
  display: flex;
  flex-direction: column;
  gap: 24px;
}
</style>
